[DOP-27550] fix mistakes
