--- a/mddocs/reference/server/auth/dummy.md
+++ b/mddocs/reference/server/auth/dummy.md
@@ -8,59 +8,52 @@ After successful auth, username is saved to backend database.
 
 ## Interaction schema
 
-```plantuml title="Interaction schema"
+```mermaid
+sequenceDiagram
+participant "Client"
+participant "Backend"
 
-        @startuml
-            title DummyAuthProvider
-            participant "Client"
-            participant "Backend"
+activate "Client"
+alt Successful case
+"Client" ->> "Backend"  : login + password
+"Backend" ->> "Backend" : Password is completely ignored
+"Backend" ->> "Backend" : Check user in internal backend database
+"Backend" ->> "Backend" : Create user if not exist
+"Backend" ->> "Client"  : Generate and return access_token
 
-            == POST v1/auth/token ==
+else User is blocked
+"Client" ->> "Backend"  : login + password
+"Backend" ->> "Backend" : Password is completely ignored
+"Backend" ->> "Backend" : Check user in internal backend database
+"Backend" --x "Client"  : 401 Unauthorized
 
-            activate "Client"
-            alt Successful case
-                "Client" -> "Backend" ++ : login + password
-                "Backend" --> "Backend" : Password is completely ignored
-                "Backend" --> "Backend" : Check user in internal backend database
-                "Backend" -> "Backend" : Create user if not exist
-                "Backend" -[#green]> "Client" -- : Generate and return access_token
+else User is deleted
+"Client" ->> "Backend"  : login + password
+"Backend" ->> "Backend" : Password is completely ignored
+"Backend" ->> "Backend" : Check user in internal backend database
+"Backend" --x "Client"  : 404 Not found
+end
 
-            else User is blocked
-                "Client" -> "Backend" ++ : login + password
-                "Backend" --> "Backend" : Password is completely ignored
-                "Backend" --> "Backend" : Check user in internal backend database
-                "Backend" x-[#red]> "Client" -- : 401 Unauthorized
+alt Successful case
+"Client" ->> "Backend"  : access_token
+"Backend" ->> "Backend" : Validate token
+"Backend" ->> "Backend" : Check user in internal backend database
+"Backend" ->> "Backend" : Get data
+"Backend" ->> "Client"  : Return data
 
-            else User is deleted
-                "Client" -> "Backend" ++ : login + password
-                "Backend" --> "Backend" : Password is completely ignored
-                "Backend" --> "Backend" : Check user in internal backend database
-                "Backend" x-[#red]> "Client" -- : 404 Not found
-            end
+else Token is expired
+"Client" ->> "Backend"  : access_token
+"Backend" ->> "Backend" : Validate token
+"Backend" --x "Client"  : 401 Unauthorized
 
-            == GET v1/datasets ==
+else User is not found
+"Client" ->> "Backend"  : access_token
+"Backend" ->> "Backend" : Validate token
+"Backend" ->> "Backend" : Check user in internal backend database
+"Backend" --x "Client"  : 404 Not found
+end
 
-            alt Successful case
-                "Client" -> "Backend" ++ : access_token
-                "Backend" --> "Backend" : Validate token
-                "Backend" --> "Backend" : Check user in internal backend database
-                "Backend" -> "Backend" : Get data
-                "Backend" -[#green]> "Client" -- : Return data
-
-            else Token is expired
-                "Client" -> "Backend" ++ : access_token
-                "Backend" --> "Backend" : Validate token
-                "Backend" x-[#red]> "Client" -- : 401 Unauthorized
-
-            else User is not found
-                "Client" -> "Backend" ++ : access_token
-                "Backend" --> "Backend" : Validate token
-                "Backend" --> "Backend" : Check user in internal backend database
-                "Backend" x-[#red]> "Client" -- : 404 Not found
-            end
-
-            deactivate "Client"
-        @enduml
+deactivate "Client"
 ```
 
 ## Configuration
