--- a/mddocs/reference/server/auth/keycloak.md
+++ b/mddocs/reference/server/auth/keycloak.md
@@ -11,87 +11,86 @@ If user is not found in Data.Rentgen database, KeycloakAuthProvider creates it. 
 
 ## Interaction schema
 
-```plantuml title="Interaction schema"
-
-        @startuml
-            title DummyAuthProvider
-            participant "Frontend"
-            participant "Backend"
-            participant "Keycloak"
-
-            == Frontend Authentication at Keycloak ==
-
-            Frontend -> Backend : Request endpoint with authentication (/v1/locations)
-
-            Backend x-[#red]> Frontend: 401 with redirect url in 'details' response field
-
-            Frontend -> Keycloak : Redirect user to Keycloak login page
-
-            alt Successful login
-                Frontend --> Keycloak : Log in with login and password
-            else Login failed
-                Keycloak x-[#red]> Frontend -- : Display error (401 Unauthorized)
-            end
-
-            Keycloak -> Frontend : Callback to Frontend /callback which is proxy between Keycloak and Backend
-
-            Frontend -> Backend : Send request to Backend '/v1/auth/callback'
-
-            Backend -> Keycloak : Check original 'state' and exchange code for token's
-            Keycloak --> Backend : Return token's
-            Backend --> Frontend : Set token's in user's browser in cookies
-
-            Frontend --> Backend : Request to /v1/locations with session cookies
-            Backend -> Backend : Get user info from token and check user in internal backend database
-            Backend -> Backend : Create user in internal backend database if not exist
-            Backend -[#green]> Frontend -- : Return requested data
+```mermaid
+sequenceDiagram
+participant "Frontend"
+participant "Backend"
+participant "Keycloak"
 
 
-            == GET v1/datasets ==
+"Frontend" -> "Backend" : Request endpoint with authentication (/v1/locations)
 
+"Backend" --x "Frontend": 401 with redirect url in 'details' response field
 
-            alt Successful case
-                "Frontend" -> "Backend" ++ : access_token
-                "Backend" --> "Backend" : Validate token
-                "Backend" --> "Backend" : Check user in internal backend database
-                "Backend" -> "Backend" : Get data
-                "Backend" -[#green]> "Frontend" -- : Return data
+"Frontend" -> "Keycloak" : Redirect user to Keycloak login page
 
-            else Token is expired (Successful case)
-                "Frontend" -> "Backend" ++ : access_token, refresh_token
-                "Backend" --> "Backend" : Validate token
-                "Backend" -[#yellow]> "Backend" : Token is expired
-                "Backend" --> "Keycloak" : Try to refresh token
-                "Backend" --> "Backend" : Validate new token
-                "Backend" --> "Backend" : Check user in internal backend database
-                "Backend" -> "Backend" : Get data
-                "Backend" -[#green]> "Frontend" -- : Return data
+alt Successful login
+     "Frontend" --> "Keycloak" : Log in with login and password
+else Login failed
+     "Keycloak" --x "Frontend" : Display error (401 Unauthorized)
+end
 
-            else Create new User
-                "Frontend" -> "Backend" ++ : access_token
-                "Backend" --> "Backend" : Validate token
-                "Backend" --> "Backend" : Check user in internal backend database
-                "Backend" --> "Backend" : Create new user
-                "Backend" -> "Backend" : Get data
-                "Backend" -[#green]> "Frontend" -- : Return data
+ "Keycloak" -> "Frontend" : Callback to Frontend /callback which is proxy between Keycloak and Backend
 
-            else Token is expired and bad refresh token
-                "Frontend" -> "Backend" ++ : access_token, refresh_token
-                "Backend" --> "Backend" : Validate token
-                "Backend" -[#yellow]> "Backend" : Token is expired
-                "Backend" --> "Keycloak" : Try to refresh token
-                "Backend" x-[#red]> "Frontend" -- : RedirectResponse can't refresh
+"Frontend" -> "Backend" : Send request to Backend '/v1/auth/callback'
 
-            else Bad Token payload
-                "Frontend" -> "Backend" ++ : access_token, refresh_token
-                "Backend" --> "Backend" : Validate token
-                "Backend" x-[#red]> "Frontend" -- : 307 Authorization error
+"Backend" -> "Keycloak" : Check original 'state' and exchange code for token's
+"Keycloak" --> "Backend" : Return token's
+"Backend" --> "Frontend" : Set token's in user's browser in cookies
 
-            end
+"Frontend" --> "Backend" : Request to /v1/locations with session cookies
+"Backend" -> "Backend" : Get user info from token and check user in internal backend database
+"Backend" -> "Backend" : Create user in internal backend database if not exist
+"Backend" --> "Frontend" : Return requested data
 
-            deactivate "Frontend"
-        @enduml
+alt Successful case
+activate "Backend"
+"Frontend" -> "Backend" : access_token
+"Backend" --> "Backend" : Validate token
+"Backend" --> "Backend" : Check user in internal backend database
+"Backend" -> "Backend" : Get data
+"Backend" --> "Frontend" : Return data
+deactivate "Backend"
 
+else Token is expired (Successful case)
+activate "Backend"
+"Frontend" -> "Backend"  : access_token, refresh_token
+"Backend" --> "Backend" : Validate token
+"Backend" --> "Backend" : Token is expired
+"Backend" --> "Keycloak" : Try to refresh token
+"Backend" --> "Backend" : Validate new token
+"Backend" --> "Backend" : Check user in internal backend database
+"Backend" -> "Backend" : Get data
+"Backend" --> "Frontend" : Return data
+deactivate "Backend"
+
+else Create new User
+activate "Backend"
+"Frontend" -> "Backend"  : access_token
+"Backend" --> "Backend" : Validate token
+"Backend" --> "Backend" : Check user in internal backend database
+"Backend" --> "Backend" : Create new user
+"Backend" -> "Backend" : Get data
+"Backend" --> "Frontend" : Return data
+deactivate "Backend"
+
+else Token is expired and bad refresh token
+activate "Backend"
+"Frontend" -> "Backend" : access_token, refresh_token
+"Backend" --> "Backend" : Validate token
+"Backend" --> "Backend" : Token is expired
+"Backend" --> "Keycloak" : Try to refresh token
+"Backend" --x "Frontend" : RedirectResponse can't refresh
+deactivate "Backend"
+
+else Bad Token payload
+activate "Backend"
+"Frontend" -> "Backend" : access_token, refresh_token
+"Backend" --> "Backend" : Validate token
+"Backend" --x "Frontend" : 307 Authorization error
+deactivate "Backend"
+
+end
 ```
 
 ## Basic Configuration
